# InnerDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalSegment..::..InnerDiameter Property
MEPAnalyticalSegment Class See Also
---
The inner diameter of this segment, in ft. For rectangular or oval profile, this may be the hydraulic diameter.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double InnerDiameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property InnerDiameter As Double
	Get
```

Visual C++
---
```text
public:
property double InnerDiameter {
	double get ();
}
```

# See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace